# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 1.00  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  [[-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, MANet, [128, True, 2, 3]],
   [-1, 1, Conv, [256, 3, 2]],  # P3/8
   [-1, 6, MANet, [256, True, 2, 5]],  # 4 end backbone P3
   [-1, 1, Conv, [512, 3, 2]],  # P4/16
   [-1, 6, MANet, [512, True, 2, 5]],  # 6 end backbone P4
   [-1, 1, Conv, [1024, 3, 2]],  # P5/32
   [-1, 3, MANet, [1024, True, 2, 3]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  # Semantic Collecting
  [[0, 1, nn.AvgPool2d, [8, 8, 0]], # 10
  [2, 1, nn.AvgPool2d, [4, 4, 0]], # 11
  [4, 1, nn.AvgPool2d, [2, 2, 0]], # 12
  [9, 1, nn.Upsample, [None, 2, 'nearest']], # 13
  [[10, 11, 12, 6, 13], 1, Concat, [1]],  # cat 14

  # Hypergraph Computation
  [-1, 1, Conv, [512, 1, 1]], # 15
  [-1, 1, HyperComputeModule, [512]], # 16
  [-1, 3, MANet, [512, True, 2, 3]], # 17

  # Semantic Collecting
  [-1, 1, nn.AvgPool2d, [2, 2, 0]], # 18
  [[-1, 9], 1, Concat, [1]],  # cat 19
  [-1, 1, Conv, [1024, 1, 1]], # 20 P5

  [[17, 6], 1, Concat, [1]],  # cat 21
  [-1, 3, MANet, [512, False, 2, 3]],  # 22 P4

  [17, 1, nn.Upsample, [None, 2, 'nearest']], # 23
  [[-1, 4], 1, Concat, [1]],  # cat 24
  [-1, 3, MANet, [256, False, 2, 3]],  # 25 P3/N3

  [-1, 1, Conv, [256, 3, 2]], # 26
  [[-1, 22], 1, Concat, [1]],  # 27 cat 
  [-1, 3, MANet, [512, False, 2, 3]],  # 28 N4

  [-1, 1, Conv, [512, 3, 2]], # 29
  [[-1, 20], 1, Concat, [1]],  # 30 cat
  [-1, 3, C2f, [1024, False]],  # 31 N5
  [-1, 1, Conv, [1024, 1, 2]],  # 32 N5

  [[26, 29, 32], 1, Detect, [nc, anchors]]  # Detect(P3, P4, P5)
]
