# YOLOv5 🚀 by Ultralytics, AGPL-3.0 license

# Parameters
nc: 3  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0 to P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1 to P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # to P3/8
   [-1, 6, C3, [256]],  # 4 # end backbone P3
   [-1, 1, Conv, [512, 3, 2]],  # to P4/16
   [-1, 9, C3, [512]],  # 6 end backbone P4
   [-1, 1, Conv, [1024, 3, 2]],  # # P5/32
   [-1, 3, C3TR, [1024]],
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10 head P5
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, SimAM, [512]],
   [-1, 3, C3, [512, False]],

   [-1, 1, Conv, [256, 1, 1]],  # 15 head P4
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, SimAM, [256]],
   [-1, 3, C3, [256, False]],
   [-1, 1, Conv, [256, 3, 2]],  # 20 (P3/8-small)

   [19, 1, Conv, [256, 1, 2]],  # from last C3
   [[-1, 15], 1, Concat, [1]],  # cat head P4
   [-1, 3, SimAM, [512]],
   [-1, 3, C3, [512, False]],
   [-1, 1, Conv, [512, 1, 2]],  # 25 (P4/16-medium)

   [24, 1, Conv, [512, 3, 2]],  # from last C3
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 1, SimAM, [1024]],
   [-1, 3, C3, [1024, False]],
   [-1, 1, Conv, [1024, 1, 2]],  # 30 (P5/32-large)

   [[20, 25, 30], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]